# SF Salaries Exercise

** Import pandas as pd.**

In [1]:
#run pandas libarary 
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [9]:
#reading Salaries file and named it df
df=pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [8]:
#after upload file 
# determine top 5 rows
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [10]:
df.info() #info every information of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [14]:
#calling groupby function and basepay coloum
#determine average of basepay
base_pay=df.groupby('BasePay')
base_pay.mean()

,Id,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
BasePay,,,,,,,,,
-166.01,72833.0,249.02,0.00,6.56,83.01,89.57,2012.0,NaN,NaN
-121.63,72866.0,182.70,0.00,5.44,61.07,66.51,2012.0,NaN,NaN
-109.22,72873.0,163.83,0.00,4.32,54.61,58.93,2012.0,NaN,NaN
-106.60,72875.0,159.90,0.00,4.66,53.30,57.96,2012.0,NaN,NaN
-101.88,72879.0,153.08,0.00,4.55,51.20,55.75,2012.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
313312.52,72932.0,0.00,0.00,82319.51,313312.52,395632.03,2013.0,NaN,NaN
313686.01,72927.0,0.00,23236.00,85431.39,336922.01,422353.40,2013.0,NaN,NaN
315572.01,72930.0,0.00,0.00,82849.66,315572.01,398421.67,2013.0,NaN,NaN
318835.49,110533.0,10712.95,60563.54,89540.23,390111.98,479652.21,2014.0,NaN,NaN
319275.01,72926.0,0.00,20007.06,86533.21,339282.07,425815.28,2013.0,NaN,NaN

** What is the highest amount of OvertimePay in the dataset ? **

In [20]:
#determine maximum amount in OvertimePay coloum
df['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [24]:
#get the coloum EmployeeName and getting the all data about person 
df[df['EmployeeName']=='JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [25]:
#get the coloum TotalPayBenefits and know what the person taking  total(salary+ PayBenefits)
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [37]:
#determine  data the highest paid person in  TotalPayBenefits
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [38]:
#determine  data the lowest paid person in  TotalPayBenefits
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [28]:
#calling groupby function in year coloum and determine the average in basepay
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [29]:
#number of un reperted data in job function 
df['JobTitle'].nunique()

2159

** What are the top 5 most common jobs? **

In [30]:
#number of top repated job in JobTitle coloum 
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [33]:
#indexing the coloum job title based on the coloum year when year=2013
#then count number of  job title and number of unrepeated job 

df[df['Year']==2013]['JobTitle'].value_counts()
sum(df[df['Year']==2013]['JobTitle'].value_counts() == 1)

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!